app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "arif"], ["title", "dr"], ["url", "pt1.ca"], ["created_at", "2016-01-26 19:55:49.733887"], ["updated_at", "2016-01-26 19:55:49.733887"]]
---
  def create
    # make a new picture with what picture_params returns (which is a method we're calling)
    @picture = Picture.new(picture_params)
    if @picture.save

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "pictures" SET "artist" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["artist", "arifdfsfd"], ["updated_at", "2016-01-26 20:36:22.065513"], ["id", 4]]
---
  def update
    @picture = Picture.find(params[:id])

    if @picture.update_attributes(picture_params)